bench/results/recv-sweep-20260427-045059/hyper-recv16k.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #3.
progress: 50% of clients started
Warm-up started for thread #2.
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.00s, 181969.25 req/s, 5.14MB/s
requests: 1455754 total, 1455754 started, 1455754 done, 1455754 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1455754 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 41.15MB (43152843) total, 9.38MB (9831136) headers (space savings 89.65%), 7.81MB (8191080) data
                     min         max         mean         sd        +/- sd
time for request:       34us      5.33ms       399us       200us    81.00%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   22469.01    22879.31    22745.74      166.33    75.00%