bench/results/recv-sweep-20260427-045059/trillium-recv16k.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2Main benchmark duration is over for thread #. Stopping all clients.
1. Stopping all clients.Stopped all clients for thread #2

Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 121768.50 req/s, 15.30MB/s
requests: 974148 total, 974148 started, 974148 done, 974148 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 974148 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 122.42MB (128363590) total, 66.84MB (70090176) headers (space savings 40.74%), 5.22MB (5475795) data
                     min         max         mean         sd        +/- sd
time for request:       74us      4.61ms       620us       220us    74.89%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   15158.00    15291.77    15220.79       51.87    62.50%